import '../../css/ticket.css';
import ChangeModal from "./modals/changeModal";
import DeleteModal from "./modals/deleteModal";

export default class Ticket {
    constructor(name, description, created, id) {
        this.name = name;
        this.description = description;
        this.created = created;
        this.id = id;
    }
    getTicketMarkup() {
        return `
            <div class="ticket-wrapper" data-id="${this.id}">
                <div class="ticket-left-side">
                    <span class="status"></span>
                    <div class="ticket-about-wrapper">
                        <h3 class="ticket-name">${this.name}</h3>
                        <p class="ticket-description">${this.description}</p>
                    </div>
                </div>
                <div class="ticket-right-side">
                    <span class="ticket-created-date">${this.created}</span>
                    <span class="ticket-change">
                        <svg xmlns="http://www.w3.org/2000/svg" class="ticket-change" width="17" height="17" viewBox="0 0 17 17" fill="none">
                            <path d="M12.232 1.75671C12.4228 1.53109 12.6586 1.34745 12.9247 1.21748C13.1908 1.08751 13.4811 1.01406 13.7773 1.00183C14.0735 0.989594 14.369 1.03884 14.645 1.14642C14.921 1.254 15.1714 1.41755 15.3802 1.62666C15.5891 1.83578 15.7519 2.08585 15.8582 2.36096C15.9644 2.63606 16.0119 2.93016 15.9975 3.22451C15.9831 3.51885 15.9072 3.80699 15.7746 4.07055C15.6419 4.33411 15.4556 4.56731 15.2273 4.7553L5.11842 14.8755L1 16L2.1232 11.8769L12.232 1.75671Z" stroke="#3B4145" stroke-width="1.16393" stroke-linecap="round" stroke-linejoin="round"/>
                        </svg>
                    </span>
                    <span class="ticket-delete">
                        <svg xmlns="http://www.w3.org/2000/svg" class="ticket-delete" width="17" height="18" viewBox="0 0 17 18" fill="none">
                            <path d="M16.0357 2.62631H12.7528V1.96973C12.7528 1.44733 12.5453 0.946317 12.1759 0.576921C11.8065 0.207525 11.3055 0 10.7831 0H6.84364C6.32124 0 5.82023 0.207525 5.45083 0.576921C5.08144 0.946317 4.87391 1.44733 4.87391 1.96973V2.62631H1.59103C1.41689 2.62631 1.24989 2.69548 1.12676 2.81862C1.00362 2.94175 0.934448 3.10875 0.934448 3.28289C0.934448 3.45702 1.00362 3.62402 1.12676 3.74716C1.24989 3.87029 1.41689 3.93946 1.59103 3.93946H2.2476V15.7579C2.2476 16.1061 2.38595 16.4401 2.63222 16.6864C2.87848 16.9327 3.21249 17.071 3.56076 17.071H14.066C14.4143 17.071 14.7483 16.9327 14.9945 16.6864C15.2408 16.4401 15.3791 16.1061 15.3791 15.7579V3.93946H16.0357C16.2099 3.93946 16.3769 3.87029 16.5 3.74716C16.6231 3.62402 16.6923 3.45702 16.6923 3.28289C16.6923 3.10875 16.6231 2.94175 16.5 2.81862C16.3769 2.69548 16.2099 2.62631 16.0357 2.62631ZM6.18707 1.96973C6.18707 1.7956 6.25624 1.62859 6.37937 1.50546C6.5025 1.38233 6.66951 1.31315 6.84364 1.31315H10.7831C10.9572 1.31315 11.1242 1.38233 11.2474 1.50546C11.3705 1.62859 11.4397 1.7956 11.4397 1.96973V2.62631H6.18707V1.96973ZM14.066 15.7579H3.56076V3.93946H14.066V15.7579ZM7.50022 7.22235V12.475C7.50022 12.6491 7.43104 12.8161 7.30791 12.9392C7.18478 13.0624 7.01778 13.1315 6.84364 13.1315C6.66951 13.1315 6.5025 13.0624 6.37937 12.9392C6.25624 12.8161 6.18707 12.6491 6.18707 12.475V7.22235C6.18707 7.04821 6.25624 6.88121 6.37937 6.75808C6.5025 6.63495 6.66951 6.56577 6.84364 6.56577C7.01778 6.56577 7.18478 6.63495 7.30791 6.75808C7.43104 6.88121 7.50022 7.04821 7.50022 7.22235ZM11.4397 7.22235V12.475C11.4397 12.6491 11.3705 12.8161 11.2474 12.9392C11.1242 13.0624 10.9572 13.1315 10.7831 13.1315C10.609 13.1315 10.442 13.0624 10.3188 12.9392C10.1957 12.8161 10.1265 12.6491 10.1265 12.475V7.22235C10.1265 7.04821 10.1957 6.88121 10.3188 6.75808C10.442 6.63495 10.609 6.56577 10.7831 6.56577C10.9572 6.56577 11.1242 6.63495 11.2474 6.75808C11.3705 6.88121 11.4397 7.04821 11.4397 7.22235Z" fill="#3B4145"/>
                        </svg>
                    </span>
                </div>
            </div>
        `
    }

    static deleteTicket(ticketEl, ticketsContainer, noTicketSpan) {
        // вызывает модальное окно удаления
        const deleteModal = new DeleteModal(ticketEl, ticketsContainer, noTicketSpan);
        deleteModal.bindToDOM();
    }
    static changeTicket(ticketEl) {
        // вызывает модальное окно изменения
        const changeModal = new ChangeModal(ticketEl);
        changeModal.bindToDOM();
    }
}